package org.example;

public class Main {
    public static void main(String[] args) {

    }
}
/**
 * Коллекции. Список
 * 1 Дан список строк. Отфильтруйте список так, чтобы в нём остались только те строки, которые содержат адреса электронной почты.

 * 2 Напишите метод, который принимает два списка, сортирует их, объединяет в один и записывает элементы в обратном порядке.
 * Используйте методы интерфейса List и класс Collections.

 * 4 Напишите программу, которая учитывает все финансовые транзакции пользователя за месяц.
 * Пользователь вводит суммы каждой транзакции, и они добавляются в список.
 * Программа должна выводить общую сумму расходов и доходов за указанный месяц, а также баланс.
 * Суммы операций нужно хранить, используя списки List<Double> или List<BigDecimal>.

 */